jwy8612/monitor/software/header/_iom640to2561v.h
#ifndef ___iom640to2561v_h
#define ___iom640to2561v_h

/* ATmega640..2561 io header file for
 * ImageCraft ICCAVR compiler
 */

/* 2004/12/19 created as iom2560v.h
   2005/03/10 fixed SPI bits
   2005/05/12 fixed EECR "P" bits
   2005/05/16 added GPIOR0..2
   2006/02/11 fixed device #define and CKOUT
   2008/04/21 added USART bits for SPI mode
 */

/* Port L */
#define PINL	(*(volatile unsigned char *)0x109) /* m/m */
#define DDRL	(*(volatile unsigned char *)0x10A) /* m/m */
#define PORTL	(*(volatile unsigned char *)0x10B) /* m/m */

/* Port K */
#define PINK	(*(volatile unsigned char *)0x106) /* m/m */
#define DDRK	(*(volatile unsigned char *)0x107) /* m/m */
#define PORTK	(*(volatile unsigned char *)0x108) /* m/m */

/* Port J */
#define PINJ	(*(volatile unsigned char *)0x103) /* m/m */
#define DDRJ	(*(volatile unsigned char *)0x104) /* m/m */
#define PORTJ	(*(volatile unsigned char *)0x105) /* m/m */

/* Port H */
#define PINH	(*(volatile unsigned char *)0x100) /* m/m */
#define DDRH	(*(volatile unsigned char *)0x101) /* m/m */
#define PORTH	(*(volatile unsigned char *)0x102) /* m/m */

/* Port G */
#define PING	(*(volatile unsigned char *)0x32)
#define DDRG	(*(volatile unsigned char *)0x33)
#define PORTG	(*(volatile unsigned char *)0x34)

/* Port F */
#define PINF	(*(volatile unsigned char *)0x2F)
#define DDRF	(*(volatile unsigned char *)0x30)
#define PORTF	(*(volatile unsigned char *)0x31)

/* Port E */
#define PINE	(*(volatile unsigned char *)0x2C)
#define DDRE	(*(volatile unsigned char *)0x2D)
#define PORTE	(*(volatile unsigned char *)0x2E)

/* Port D */
#define PIND	(*(volatile unsigned char *)0x29)
#define DDRD	(*(volatile unsigned char *)0x2A)
#define PORTD	(*(volatile unsigned char *)0x2B)

/* Port C */
#define PINC	(*(volatile unsigned char *)0x26)
#define DDRC	(*(volatile unsigned char *)0x27)
#define PORTC	(*(volatile unsigned char *)0x28)

/* Port B */
#define PINB	(*(volatile unsigned char *)0x23)
#define DDRB	(*(volatile unsigned char *)0x24)
#define PORTB	(*(volatile unsigned char *)0x25)

/* Port A */
#define PINA	(*(volatile unsigned char *)0x20)
#define DDRA	(*(volatile unsigned char *)0x21)
#define PORTA	(*(volatile unsigned char *)0x22)

/* ADC */
#define ADC 	(*(volatile unsigned int *)0x78)
#define ADCL	(*(volatile unsigned char *)0x78)
#define ADCH	(*(volatile unsigned char *)0x79)
#define ADCSRA	(*(volatile unsigned char *)0x7A)
#define  ADEN     7
#define  ADSC     6
#define  ADATE    5
#define  ADIF     4
#define  ADIE     3
#define  ADPS2    2
#define  ADPS1    1
#define  ADPS0    0
#define ADCSRB	(*(volatile unsigned char *)0x7B)
#define  ACME     6
#define  MUX5     3
#define  ADTS2    2
#define  ADTS1    1
#define  ADTS0    0
#define ADMUX	(*(volatile unsigned char *)0x7C)
#define  REFS1    7
#define  REFS0    6
#define  ADLAR    5
#define  MUX4     4
#define  MUX3     3
#define  MUX2     2
#define  MUX1     1
#define  MUX0     0

/* Analog Comparator Control and Status Register */
#define ACSR	(*(volatile unsigned char *)0x50)
#define  ACD      7
#define  ACBG     6
#define  ACO      5
#define  ACI      4
#define  ACIE     3
#define  ACIC     2
#define  ACIS1    1
#define  ACIS0    0

/* DIDR */
#define DIDR2	(*(volatile unsigned char *)0x7D) /* m/m */
#define  ADC15D   7
#define  ADC14D   6
#define  ADC13D   5
#define  ADC12D   4
#define  ADC11D   3
#define  ADC10D   2
#define  ADC9D    1
#define  ADC8D    0
#define DIDR0	(*(volatile unsigned char *)0x7E) /* m/m */
#define  ADC7D    7
#define  ADC6D    6
#define  ADC5D    5
#define  ADC4D    4
#define  ADC3D    3
#define  ADC2D    2
#define  ADC1D    1
#define  ADC0D    0
#define DIDR1	(*(volatile unsigned char *)0x7F) /* m/m */
#define  AIN1D    1
#define  AIN0D    0

/* USART0 */
#define UBRR0H	(*(volatile unsigned char *)0xC5) /* m/m */
#define UBRR0L	(*(volatile unsigned char *)0xC4) /* m/m */
#define UBRR0	(*(volatile unsigned int *)0xC4) /* m/m */
#define UCSR0C	(*(volatile unsigned char *)0xC2) /* m/m */
#define  UMSEL01  7
#define  UMSEL00  6
#define  UPM01    5
#define  UPM00    4
#define  USBS0    3
#define  UCSZ01   2
#define  UCSZ00   1
#define  UCPOL0   0
/* in SPI mode */
#define  UDORD0   2
#define  UCPHA0   1
#define UCSR0B	(*(volatile unsigned char *)0xC1) /* m/m */
#define  RXCIE0   7
#define  TXCIE0   6
#define  UDRIE0   5
#define  RXEN0    4
#define  TXEN0    3
#define  UCSZ02   2
#define  RXB80    1
#define  TXB80    0
#define UCSR0A	(*(volatile unsigned char *)0xC0) /* m/m */
#define  RXC0     7
#define  TXC0     6
#define  UDRE0    5
#define  FE0      4
#define  DOR0     3
#define  UPE0     2
#define  U2X0     1
#define  MPCM0    0
#define UDR0	(*(volatile unsigned char *)0xC6) /* m/m */

/* USART1 */
#define UBRR1H	(*(volatile unsigned char *)0xCD) /* m/m */
#define UBRR1L	(*(volatile unsigned char *)0xCC) /* m/m */
#define UBRR1	(*(volatile unsigned int *)0xCC) /* m/m */
#define UCSR1C	(*(volatile unsigned char *)0xCA) /* m/m */
#define  UMSEL11  7
#define  UMSEL10  6
#define  UPM11    5
#define  UPM10    4
#define  USBS1    3
#define  UCSZ11   2
#define  UCSZ10   1
#define  UCPOL1   0
/* in SPI mode */
#define  UDORD1   2
#define  UCPHA1   1
#define UCSR1B	(*(volatile unsigned char *)0xC9) /* m/m */
#define  RXCIE1   7
#define  TXCIE1   6
#define  UDRIE1   5
#define  RXEN1    4
#define  TXEN1    3
#define  UCSZ12   2
#define  RXB81    1
#define  TXB81    0
#define UCSR1A	(*(volatile unsigned char *)0xC8) /* m/m */
#define  RXC1     7
#define  TXC1     6
#define  UDRE1    5
#define  FE1      4
#define  DOR1     3
#define  UPE1     2
#define  U2X1     1
#define  MPCM1    0
#define UDR1	(*(volatile unsigned char *)0xCE) /* m/m */

/* USART2 */
#define UBRR2H	(*(volatile unsigned char *)0xD5) /* m/m */
#define UBRR2L	(*(volatile unsigned char *)0xD4) /* m/m */
#define UBRR2	(*(volatile unsigned int *)0xD4) /* m/m */
#define UCSR2C	(*(volatile unsigned char *)0xD2) /* m/m */
#define  UMSEL21  7
#define  UMSEL20  6
#define  UPM21    5
#define  UPM20    4
#define  USBS2    3
#define  UCSZ21   2
#define  UCSZ20   1
#define  UCPOL2   0
/* in SPI mode */
#define  UDORD2   2
#define  UCPHA2   1
#define UCSR2B	(*(volatile unsigned char *)0xD1) /* m/m */
#define  RXCIE2   7
#define  TXCIE2   6
#define  UDRIE2   5
#define  RXEN2    4
#define  TXEN2    3
#define  UCSZ22   2
#define  RXB82    1
#define  TXB82    0
#define UCSR2A	(*(volatile unsigned char *)0xD0) /* m/m */
#define  RXC2     7
#define  TXC2     6
#define  UDRE2    5
#define  FE2      4
#define  DOR2     3
#define  UPE2     2
#define  U2X2     1
#define  MPCM2    0
#define UDR2	(*(volatile unsigned char *)0xD6) /* m/m */

/* USART3 */
#define UBRR3H	(*(volatile unsigned char *)0x135) /* m/m */
#define UBRR3L	(*(volatile unsigned char *)0x134) /* m/m */
#define UBRR3	(*(volatile unsigned int *)0x134) /* m/m */
#define UCSR3C	(*(volatile unsigned char *)0x132) /* m/m */
#define  UMSEL31  7
#define  UMSEL30  6
#define  UPM31    5
#define  UPM30    4
#define  USBS3    3
#define  UCSZ31   2
#define  UCSZ30   1
#define  UCPOL3   0
/* in SPI mode */
#define  UDORD3   2
#define  UCPHA3   1
#define UCSR3B	(*(volatile unsigned char *)0x131) /* m/m */
#define  RXCIE3   7
#define  TXCIE3   6
#define  UDRIE3   5
#define  RXEN3    4
#define  TXEN3    3
#define  UCSZ32   2
#define  RXB83    1
#define  TXB83    0
#define UCSR3A	(*(volatile unsigned char *)0x130) /* m/m */
#define  RXC3     7
#define  TXC3     6
#define  UDRE3    5
#define  FE3      4
#define  DOR3     3
#define  UPE3     2
#define  U2X3     1
#define  MPCM3    0
#define UDR3	(*(volatile unsigned char *)0x136) /* m/m */

/* 2-wire SI */
#define TWBR	(*(volatile unsigned char *)0xB8) /* m/m */
#define TWSR	(*(volatile unsigned char *)0xB9) /* m/m */
#define  TWPS1    1
#define  TWPS0    0
#define TWAR	(*(volatile unsigned char *)0xBA) /* m/m */
#define  TWGCE    0
#define TWDR	(*(volatile unsigned char *)0xBB) /* m/m */
#define TWCR	(*(volatile unsigned char *)0xBC) /* m/m */
#define  TWINT    7
#define  TWEA     6
#define  TWSTA    5
#define  TWSTO    4
#define  TWWC     3
#define  TWEN     2
#define  TWIE     0
#define TWAMR	(*(volatile unsigned char *)0xBD) /* m/m */

/* SPI */
#define SPCR	(*(volatile unsigned char *)0x4C)
#define  SPIE     7
#define  SPE      6
#define  DORD     5
#define  MSTR     4
#define  CPOL     3
#define  CPHA     2
#define  SPR1     1
#define  SPR0     0
#define SPSR	(*(volatile unsigned char *)0x4D)
#define  SPIF     7
#define  WCOL     6
#define  SPI2X    0
#define SPDR	(*(volatile unsigned char *)0x4E)

/* EEPROM */
#define EECR	(*(volatile unsigned char *)0x3F)
#define  EEPM1    5
#define  EEPM0    4
#define  EERIE    3
#define  EEMPE    2
#define  EEMWE    2
#define  EEPE     1
#define  EEWE     1
#define  EERE     0
#define EEDR	(*(volatile unsigned char *)0x40)
#define EEAR	(*(volatile unsigned int *)0x41)
#define EEARL	(*(volatile unsigned char *)0x41)
#define EEARH	(*(volatile unsigned char *)0x42)

