jwy8612/monitor/software/header/_iom640to2561v.h
/* Port G */
#define  PORTG5   5
#define  PORTG4   4
#define  PORTG3   3
#define  PORTG2   2
#define  PORTG1   1
#define  PORTG0   0
#define  PG5      5
#define  PG4      4
#define  PG3      3
#define  PG2      2
#define  PG1      1
#define  PG0      0
#define  DDG5     5
#define  DDG4     4
#define  DDG3     3
#define  DDG2     2
#define  DDG1     1
#define  DDG0     0
#define  PING5    5
#define  PING4    4
#define  PING3    3
#define  PING2    2
#define  PING1    1
#define  PING0    0

/* Port H */
#define  PORTH7   7
#define  PORTH6   6
#define  PORTH5   5
#define  PORTH4   4
#define  PORTH3   3
#define  PORTH2   2
#define  PORTH1   1
#define  PORTH0   0
#define  PH7      7
#define  PH6      6
#define  PH5      5
#define  PH4      4
#define  PH3      3
#define  PH2      2
#define  PH1      1
#define  PH0      0
#define  DDH7     7
#define  DDH6     6
#define  DDH5     5
#define  DDH4     4
#define  DDH3     3
#define  DDH2     2
#define  DDH1     1
#define  DDH0     0
#define  PINH7    7
#define  PINH6    6
#define  PINH5    5
#define  PINH4    4
#define  PINH3    3
#define  PINH2    2
#define  PINH1    1
#define  PINH0    0

/* Port J */
#define  PORTJ7   7
#define  PORTJ6   6
#define  PORTJ5   5
#define  PORTJ4   4
#define  PORTJ3   3
#define  PORTJ2   2
#define  PORTJ1   1
#define  PORTJ0   0
#define  PJ7      7
#define  PJ6      6
#define  PJ5      5
#define  PJ4      4
#define  PJ3      3
#define  PJ2      2
#define  PJ1      1
#define  PJ0      0
#define  DDJ7     7
#define  DDJ6     6
#define  DDJ5     5
#define  DDJ4     4
#define  DDJ3     3
#define  DDJ2     2
#define  DDJ1     1
#define  DDJ0     0
#define  PINJ7    7
#define  PINJ6    6
#define  PINJ5    5
#define  PINJ4    4
#define  PINJ3    3
#define  PINJ2    2
#define  PINJ1    1
#define  PINJ0    0

/* Port K */
#define  PORTK7   7
#define  PORTK6   6
#define  PORTK5   5
#define  PORTK4   4
#define  PORTK3   3
#define  PORTK2   2
#define  PORTK1   1
#define  PORTK0   0
#define  PK7      7
#define  PK6      6
#define  PK5      5
#define  PK4      4
#define  PK3      3
#define  PK2      2
#define  PK1      1
#define  PK0      0
#define  DDK7     7
#define  DDK6     6
#define  DDK5     5
#define  DDK4     4
#define  DDK3     3
#define  DDK2     2
#define  DDK1     1
#define  DDK0     0
#define  PINK7    7
#define  PINK6    6
#define  PINK5    5
#define  PINK4    4
#define  PINK3    3
#define  PINK2    2
#define  PINK1    1
#define  PINK0    0

/* Port L */
#define  PORTL7   7
#define  PORTL6   6
#define  PORTL5   5
#define  PORTL4   4
#define  PORTL3   3
#define  PORTL2   2
#define  PORTL1   1
#define  PORTL0   0
#define  PL7      7
#define  PL6      6
#define  PL5      5
#define  PL4      4
#define  PL3      3
#define  PL2      2
#define  PL1      1
#define  PL0      0
#define  DDL7     7
#define  DDL6     6
#define  DDL5     5
#define  DDL4     4
#define  DDL3     3
#define  DDL2     2
#define  DDL1     1
#define  DDL0     0
#define  PINL7    7
#define  PINL6    6
#define  PINL5    5
#define  PINL4    4
#define  PINL3    3
#define  PINL2    2
#define  PINL1    1
#define  PINL0    0

/* PCMSK2 */
#define  PCINT23  7
#define  PCINT22  6
#define  PCINT21  5
#define  PCINT20  4
#define  PCINT19  3
#define  PCINT18  2
#define  PCINT17  1
#define  PCINT16  0
/* PCMSK1 */
#define  PCINT15  7
#define  PCINT14  6
#define  PCINT13  5
#define  PCINT12  4
#define  PCINT11  3
#define  PCINT10  2
#define  PCINT9   1
#define  PCINT8   0
/* PCMSK0 */
#define  PCINT7   7
#define  PCINT6   6
#define  PCINT5   5
#define  PCINT4   4
#define  PCINT3   3
#define  PCINT2   2
#define  PCINT1   1
#define  PCINT0   0


/* Lock and Fuse Bits with LPM/SPM instructions */

/* lock bits */
#define  BLB12    5
#define  BLB11    4
#define  BLB02    3
#define  BLB01    2
#define  LB2      1
#define  LB1      0

/* fuses low bits */
#define  CKDIV8   7
#define  CKOUT    6
#define  SUT1     5
#define  SUT0     4
#define  CKSEL3   3
#define  CKSEL2   2
#define  CKSEL1   1
#define  CKSEL0   0

/* fuses high bits */
#define  OCDEN    7
#define  JTAGEN   6
#define  SPIEN    5
#define  WDTON    4
#define  EESAVE   3
#define  BOOTSZ1  2
#define  BOOTSZ0  1
#define  BOOTRST  0

/* extended fuses */
#define  BODLEVEL2 2
#define  BODLEVEL1 1
#define  BODLEVEL0 0


/* Interrupt Vector Numbers */

#define iv_RESET        1
#define iv_INT0         2
#define iv_EXT_INT0     2
#define iv_INT1         3
#define iv_EXT_INT1     3
#define iv_INT2         4
#define iv_EXT_INT2     4
#define iv_INT3         5
#define iv_EXT_INT3     5
#define iv_INT4         6
#define iv_EXT_INT4     6
#define iv_INT5         7
#define iv_EXT_INT5     7
#define iv_INT6         8
#define iv_EXT_INT6     8
#define iv_INT7         9
#define iv_EXT_INT7     9
#define iv_PCINT0       10
#define iv_PCINT1       11
#define iv_PCINT2       12
#define iv_WDT          13
#define iv_TIMER2_COMPA 14
#define iv_TIMER2_COMPB 15
#define iv_TIMER2_OVF   16
#define iv_TIM2_COMPA   14
#define iv_TIM2_COMPB   15
#define iv_TIM2_OVF     16
#define iv_TIMER1_CAPT  17
#define iv_TIMER1_COMPA 18
#define iv_TIMER1_COMPB 19
#define iv_TIMER1_COMPC 20
#define iv_TIMER1_OVF   21
#define iv_TIM1_CAPT    17
#define iv_TIM1_COMPA   18
#define iv_TIM1_COMPB   19
#define iv_TIM1_COMPC   20
#define iv_TIM1_OVF     21
#define iv_TIMER0_COMPA 22
#define iv_TIMER0_COMPB 23
#define iv_TIMER0_OVF   24
#define iv_TIM0_COMPA   22
#define iv_TIM0_COMPB   23
#define iv_TIM0_OVF     24
#define iv_SPI_STC      25
#define iv_USART0_RX    26
#define iv_USART0_RXC   26
#define iv_USART0_DRE   27
#define iv_USART0_UDRE  27
#define iv_USART0_TX    28
#define iv_USART0_TXC   28
#define iv_ANA_COMP     29
#define iv_ANALOG_COMP  29
#define iv_ADC          30
#define iv_EE_RDY       31
#define iv_EE_READY     31
#define iv_TIMER3_CAPT  32
#define iv_TIMER3_COMPA 33
#define iv_TIMER3_COMPB 34
#define iv_TIMER3_COMPC 35
#define iv_TIMER3_OVF   36
#define iv_TIM3_CAPT    32
#define iv_TIM3_COMPA   33
#define iv_TIM3_COMPB   34
#define iv_TIM3_COMPC   35
#define iv_TIM3_OVF     36
#define iv_USART1_RX    37
#define iv_USART1_RXC   37
#define iv_USART1_DRE   38
#define iv_USART1_UDRE  38
#define iv_USART1_TX    39
#define iv_USART1_TXC   39
#define iv_TWI          40
#define iv_TWSI         40
#define iv_SPM_RDY      41
#define iv_SPM_READY    41
#define iv_TIMER4_CAPT  42
#define iv_TIMER4_COMPA 43
#define iv_TIMER4_COMPB 44
#define iv_TIMER4_COMPC 45
#define iv_TIMER4_OVF   46
#define iv_TIM4_CAPT    42
#define iv_TIM4_COMPA   43
#define iv_TIM4_COMPB   44
#define iv_TIM4_COMPC   45
#define iv_TIM4_OVF     46
#define iv_TIMER5_CAPT  47
#define iv_TIMER5_COMPA 48
#define iv_TIMER5_COMPB 49
#define iv_TIMER5_COMPC 50
#define iv_TIMER5_OVF   51
#define iv_TIM5_CAPT    47
#define iv_TIM5_COMPA   48
#define iv_TIM5_COMPB   49
#define iv_TIM5_COMPC   50
#define iv_TIM5_OVF     51
#define iv_USART2_RX    52
#define iv_USART2_RXC   52
#define iv_USART2_DRE   53
#define iv_USART2_UDRE  53
#define iv_USART2_TX    54
#define iv_USART2_TXC   54
#define iv_USART3_RX    55
#define iv_USART3_RXC   55
#define iv_USART3_DRE   56
#define iv_USART3_UDRE  56
#define iv_USART3_TX    57
#define iv_USART3_TXC   57

/*ja*/

#endif
